burgrp/py32-svd/svd/py32md430xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DMA</name>
      <description>Direct memory access</description>
      <groupName>DMA</groupName>
      <baseAddress>0x40020000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>DMA_Channel1</name>
        <description>DMA Channel 1 Interrupt</description>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>DMA_Channel2_3</name>
        <description>DMA Channel 2 and Channel 3 Interrupt</description>
        <value>10</value>
      </interrupt>
      <registers>
        <register>
          <name>ISR</name>
          <displayName>ISR</displayName>
          <description>DMA interrupt status register(DMA_ISR)</description>
          <addressOffset>0x0</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>GIF1</name>
              <description>Channel 1 Global interrupt flag</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TCIF1</name>
              <description>Channel 1 Transfer Complete flag</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>HTIF1</name>
              <description>Channel 1 Half Transfer Complete flag</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TEIF1</name>
              <description>Channel 1 Transfer Error flag</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>GIF2</name>
              <description>Channel 2 Global interrupt flag</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TCIF2</name>
              <description>Channel 2 Transfer Complete flag</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>HTIF2</name>
              <description>Channel 2 Half Transfer Complete flag</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TEIF2</name>
              <description>Channel 2 Transfer Error flag</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>GIF3</name>
              <description>Channel 3 Global interrupt flag</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TCIF3</name>
              <description>Channel 3 Transfer Complete flag</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>HTIF3</name>
              <description>Channel 3 Half Transfer Complete flag</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>TEIF3</name>
              <description>Channel 3 Transfer Error flag</description>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IFCR</name>
          <displayName>IFCR</displayName>
          <description>DMA interrupt flag clear register(DMA_IFCR)</description>
          <addressOffset>0x4</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>CGIF1</name>
              <description>Channel 1 Global interrupt clear</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CTCIF1</name>
              <description>Channel 1 Transfer Complete clear</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CHTIF1</name>
              <description>Channel 1 Half Transfer clear</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CTEIF1</name>
              <description>Channel 1 Transfer Error clear</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CGIF2</name>
              <description>Channel 2 Global interrupt clear</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CTCIF2</name>
              <description>Channel 2 Transfer Complete clear</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CHTIF2</name>
              <description>Channel 2 Half Transfer clear</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CTEIF2</name>
              <description>Channel 2 Transfer Error clear</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CGIF3</name>
              <description>Channel 3 Global interrupt clear</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CTCIF3</name>
              <description>Channel 3 Transfer Complete clear</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CHTIF3</name>
              <description>Channel 3 Half Transfer clear</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CTEIF3</name>
              <description>Channel 3 Transfer Error clear</description>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR1</name>
          <displayName>CCR1</displayName>
          <description>DMA channel configuration register(DMA_CCR)</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>EN</name>
              <description>Channel enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TCIE</name>
              <description>Transfer complete interrupt enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>HTIE</name>
              <description>Half Transfer interrupt enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TEIE</name>
              <description>Transfer error interrupt enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>DIR</name>
              <description>Data transfer direction</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CIRC</name>
              <description>Circular mode</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PINC</name>
              <description>Peripheral increment mode</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>MINC</name>
              <description>Memory increment mode</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PSIZE</name>
              <description>Peripheral size</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>MSIZE</name>
              <description>Memory size</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>PL</name>
              <description>Channel Priority level</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>MEM2MEM</name>
              <description>Memory to memory mode</description>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNDTR1</name>
          <displayName>CNDTR1</displayName>
          <description>DMA channel 1 number of dataregister</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>NDT</name>
              <description>Number of data to transfer</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPAR1</name>
          <displayName>CPAR1</displayName>
          <description>DMA channel 1 peripheral addressregister</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>PA</name>
              <description>Peripheral address</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CMAR1</name>
          <displayName>CMAR1</displayName>
          <description>DMA channel 1 memory addressregister</description>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>MA</name>
              <description>Memory address</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR2</name>
          <displayName>CCR2</displayName>
          <description>DMA channel configuration register(DMA_CCR)</description>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>EN</name>
              <description>Channel enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TCIE</name>
              <description>Transfer complete interrupt enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>HTIE</name>
              <description>Half Transfer interrupt enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TEIE</name>
              <description>Transfer error interrupt enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>DIR</name>
              <description>Data transfer direction</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CIRC</name>
              <description>Circular mode</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PINC</name>
              <description>Peripheral increment mode</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>MINC</name>
              <description>Memory increment mode</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PSIZE</name>
              <description>Peripheral size</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>MSIZE</name>
              <description>Memory size</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>PL</name>
              <description>Channel Priority level</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>MEM2MEM</name>
              <description>Memory to memory mode</description>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNDTR2</name>
          <displayName>CNDTR2</displayName>
          <description>DMA channel 2 number of dataregister</description>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>NDT</name>
              <description>Number of data to transfer</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPAR2</name>
          <displayName>CPAR2</displayName>
          <description>DMA channel 2 peripheral addressregister</description>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>PA</name>
              <description>Peripheral address</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CMAR2</name>
          <displayName>CMAR2</displayName>
          <description>DMA channel 2 memory addressregister</description>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>MA</name>
              <description>Memory address</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR3</name>
          <displayName>CCR3</displayName>
          <description>DMA channel configuration register(DMA_CCR)</description>
          <addressOffset>0x30</addressOffset>
          <fields>
            <field>
              <name>EN</name>
              <description>Channel enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TCIE</name>
              <description>Transfer complete interrupt enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>HTIE</name>
              <description>Half Transfer interrupt enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TEIE</name>
              <description>Transfer error interrupt enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>DIR</name>
              <description>Data transfer direction</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CIRC</name>
              <description>Circular mode</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PINC</name>
              <description>Peripheral increment mode</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>MINC</name>
              <description>Memory increment mode</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PSIZE</name>
              <description>Peripheral size</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>MSIZE</name>
              <description>Memory size</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>PL</name>
              <description>Channel Priority level</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>MEM2MEM</name>
              <description>Memory to memory mode</description>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNDTR3</name>
          <displayName>CNDTR3</displayName>
          <description>DMA channel 3 number of dataregister</description>
          <addressOffset>0x34</addressOffset>
          <fields>
            <field>
              <name>NDT</name>
              <description>Number of data to transfer</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPAR3</name>
          <displayName>CPAR3</displayName>
          <description>DMA channel 3 peripheral addressregister</description>
          <addressOffset>0x38</addressOffset>
          <fields>
            <field>
              <name>PA</name>
              <description>Peripheral address</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CMAR3</name>
          <displayName>CMAR3</displayName>
          <description>DMA channel 3 memory addressregister</description>
          <addressOffset>0x3C</addressOffset>
          <fields>
            <field>
              <name>MA</name>
              <description>Memory address</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
